bhanuprakashjh/ProjectGaruda/dspic33AKESC/motor/hwzc.c
    /* advancePlus30Fp8 = (30 + advDeg) × 256 / 60. Max value at advDeg=30 is 256;
     * at advDeg=0 is 128. Fits comfortably in uint16. */
    uint16_t advFp8 = (uint16_t)(((30u + (uint32_t)advDeg) * 256u) / 60u);

#if FEATURE_HWZC_PI_DEFENSIVE
    /* Track whether THIS event has a capture (BEFORE the gate below
     * consumes captureValid). Used by the defensive-mode streak counters
     * regardless of whether the capture passes the 0<cap<T range check.
     * A rejected capture (cap > T) is NOT silence — only "captureValid==
     * false at entry" counts toward the defensive trigger. */
    bool hadCaptureThisEvent = pData->hwzc.captureValid;
#endif

    /* Run PI if we have a fresh capture from this sector */
    if (pData->hwzc.captureValid) {
        /* capValue = elapsed HR ticks FROM THE START OF THIS SECTOR (i.e. the
         * most recent commutation = lastCommStamp) TO the captured ZC.
         *
         * Timing: OnPiPeriodExpired fires BEFORE OnCommutation runs. So at
         * this moment, lastCommStamp still holds T_N (start of the sector
         * that's ending), and lastCaptureHR ≈ T_N + T/2 (ZC at midpoint).
         * After PI math, OnCommutation shifts prevCommHR ← lastCommStamp
         * and lastCommStamp ← now. Modular subtraction handles SCCP2 wrap
         * (every ~42 s at 100 MHz). */
        uint32_t capValue = pData->hwzc.lastCaptureHR - pData->hwzc.lastCommStamp;
        uint32_t setValue = ((uint32_t)advFp8 * T) >> 8;

        /* Cross-sector reject (same gate in both float and int paths). */
        if (capValue > T) {
            pData->hwzc.dbgPiMissCount++;
            pData->hwzc.captureValid = false;
            goto pi_commutate;
        }

        int32_t delta = (int32_t)capValue - (int32_t)setValue;

        /* Per-capture delta clamp — ASYMMETRIC at high RPM. */
        int32_t posDeltaCap, negDeltaCap;
        if (T < HWZC_PI_CLAMP_HIGH_TICKS) {
            posDeltaCap = (int32_t)(T >> HWZC_PI_DELTA_CLAMP_SHIFT_HIGH);
            negDeltaCap = (int32_t)(T >> HWZC_PI_NEG_DELTA_CLAMP_SHIFT_HIGH);
        } else {
            posDeltaCap = (int32_t)(T >> HWZC_PI_DELTA_CLAMP_SHIFT);
            negDeltaCap = posDeltaCap;
        }
        if (delta >  posDeltaCap) delta =  posDeltaCap;
        if (delta < -negDeltaCap) delta = -negDeltaCap;
        pData->hwzc.dbgPiDelta = (int16_t)(delta > 32767 ? 32767
                                          : delta < -32768 ? -32768
                                          : delta);

#if FEATURE_HWZC_PI_FLOAT
        /* --- FLOAT PI (Phase 1) --- */
        float deltaF = (float)delta;
        (void)T;

  #if FEATURE_HWZC_PI_DEFENSIVE
        /* In defensive mode, ignore the capture's delta — captures during
         * a silence-recovery window can be misleading. The slow-down
         * logic below the if/else block walks T larger. */
        if (!pData->hwzc.piDefActive) {
  #endif
            pData->hwzc.integratorF += HWZC_PI_KI_FLOAT * deltaF;
            if (pData->hwzc.integratorF < (float)RT_HWZC_MIN_STEP_TICKS)
                pData->hwzc.integratorF = (float)RT_HWZC_MIN_STEP_TICKS;

            float newPerF = pData->hwzc.integratorF + HWZC_PI_KP_FLOAT * deltaF;
            if (newPerF < (float)RT_HWZC_MIN_STEP_TICKS)
                newPerF = (float)RT_HWZC_MIN_STEP_TICKS;

            pData->hwzc.timerPeriod = (uint32_t)newPerF;
            pData->hwzc.integrator  = (uint32_t)pData->hwzc.integratorF;
  #if FEATURE_HWZC_PI_DEFENSIVE
        }
  #endif
#else
        /* --- ORIGINAL INTEGER BIT-SHIFT PI --- */
        /* Integrator update — slow drift correction. */
        int32_t newInt = (int32_t)pData->hwzc.integrator + (delta >> HWZC_PI_KI_SHIFT);
        if (newInt < (int32_t)RT_HWZC_MIN_STEP_TICKS)
            newInt = (int32_t)RT_HWZC_MIN_STEP_TICKS;
        if (newInt < 0) newInt = (int32_t)RT_HWZC_MIN_STEP_TICKS;
        pData->hwzc.integrator = (uint32_t)newInt;

        /* Period update — fast dynamics. */
        int32_t newPer = (int32_t)pData->hwzc.integrator + (delta >> HWZC_PI_KP_SHIFT);
        if (newPer < (int32_t)RT_HWZC_MIN_STEP_TICKS)
            newPer = (int32_t)RT_HWZC_MIN_STEP_TICKS;
        if (newPer < 0) newPer = (int32_t)RT_HWZC_MIN_STEP_TICKS;
        pData->hwzc.timerPeriod = (uint32_t)newPer;
#endif /* FEATURE_HWZC_PI_FLOAT */

        /* Mirror to stepPeriodHR so eRPM telemetry (and the reactive
         * path's diagnostics) reflect the PI-controlled rotor period. */
        pData->hwzc.writeSeq++;
        pData->hwzc.stepPeriodHR = pData->hwzc.timerPeriod;
        pData->hwzc.writeSeq++;

        pData->hwzc.captureValid = false;
        pData->hwzc.dbgPiCaptureCount++;
        {
            uint8_t s = pData->currentStep;
            if (s < 6) pData->hwzc.dbgPiCapBySector[s]++;
        }
        if (pData->hwzc.goodZcCount < 0xFFFE) /* keep goodZc growing for telem */
            pData->hwzc.goodZcCount++;
    } else {
        /* No capture this sector — period unchanged. Robust by design.
         * Track which sector is missing so we can confirm AD1 vs AD2 split. */
        pData->hwzc.dbgPiMissCount++;
        pData->hwzc.missCount++;
        pData->hwzc.totalMissCount++;
        {
            uint8_t s = pData->currentStep;
            if (s < 6) pData->hwzc.dbgPiMissBySector[s]++;
        }
    }

#if FEATURE_HWZC_PI_DEFENSIVE
    /* --- DEFENSIVE PI streak tracking + slow-down ---
     * Only true silence (no capture event at all) counts toward the
     * defensive trigger. A capture that arrived but was rejected by the
     * range gate (cap > T) is NOT silence — those are transient
     * mismatches the PI handles normally. */
    if (hadCaptureThisEvent) {
        pData->hwzc.piDefMissStreak = 0;
        if (pData->hwzc.piDefGoodStreak < 0xFFFF)
            pData->hwzc.piDefGoodStreak++;
    } else {
        if (pData->hwzc.piDefMissStreak < 0xFFFF)
            pData->hwzc.piDefMissStreak++;
        pData->hwzc.piDefGoodStreak = 0;
    }

    /* Enter / exit defensive mode (hysteresis: 6 in / 2 out) */
    if (!pData->hwzc.piDefActive &&
        pData->hwzc.piDefMissStreak >= HWZC_PI_DEFENSIVE_TRIGGER) {
        pData->hwzc.piDefActive = 1;
        if (pData->hwzc.piDefEntryCount < 0xFFFFFFFF)
            pData->hwzc.piDefEntryCount++;
    } else if (pData->hwzc.piDefActive &&
               pData->hwzc.piDefGoodStreak >= HWZC_PI_DEFENSIVE_EXIT) {
        pData->hwzc.piDefActive = 0;
    }

    /* While defensive, walk integratorF (and timerPeriod) larger to
     * deliberately slow the bridge so the rotor can catch up. */
    if (pData->hwzc.piDefActive) {
  #if FEATURE_HWZC_PI_FLOAT
        pData->hwzc.integratorF *= (1.0f + (float)HWZC_PI_DEFENSIVE_GROW_PCT * 0.01f);
        pData->hwzc.timerPeriod = (uint32_t)pData->hwzc.integratorF;
        pData->hwzc.integrator  = (uint32_t)pData->hwzc.integratorF;
  #else
        /* Integer-PI fallback: scale by (100 + grow) / 100 */
        uint32_t scaled = (pData->hwzc.integrator
                           * (100UL + HWZC_PI_DEFENSIVE_GROW_PCT)) / 100UL;
        pData->hwzc.integrator  = scaled;
        pData->hwzc.timerPeriod = scaled;
  #endif
        /* Mirror to stepPeriodHR so telemetry stays consistent */
        pData->hwzc.writeSeq++;
        pData->hwzc.stepPeriodHR = pData->hwzc.timerPeriod;
        pData->hwzc.writeSeq++;
    }
#endif /* FEATURE_HWZC_PI_DEFENSIVE */

pi_commutate:
    /* Slow-IIR update of stepPeriodForFilterComp — this is the period used
     * in ω·τ for HWZC_ApplyFilterComp. Decoupled from timerPeriod to break
     * the positive-feedback loop where a single PI period-shrink → larger
     * ω·τ → larger CMPLO offset → earlier comparator fire → more PI shrink.
     *
     * Shift 11 → 1/2048 per sector ≈ 11 ms time constant at 190k eRPM.
     * Slow vs PI per-sector dynamics (~1 ms) → loop gain << 1.
     * Fast vs real motor accel (~50 ms) → tracks real changes adequately. */
    if (pData->hwzc.stepPeriodForFilterComp == 0) {
        pData->hwzc.stepPeriodForFilterComp = pData->hwzc.timerPeriod;
    } else {
        int32_t pDelta = (int32_t)pData->hwzc.timerPeriod
                       - (int32_t)pData->hwzc.stepPeriodForFilterComp;
        pData->hwzc.stepPeriodForFilterComp =
            (uint32_t)((int32_t)pData->hwzc.stepPeriodForFilterComp
                       + (pDelta >> 11));
    }

    /* Advance to next sector — autonomous timer drives this regardless
     * of capture state. OnCommutation re-arms BLANKING + comparator. */
    COMMUTATION_AdvanceStep(pData);
    pData->hwzc.totalCommCount++;
    pData->hwzc.commSeq++;
    pData->hwzc.stepsSinceLastHwZc = 0;
    HWZC_OnCommutation(pData);

#if FEATURE_SPEED_PI
    /* Speed PI runs after the timing PI has updated stepPeriodHR.
     * Per-ZC interval-based: this fires every sector (variable rate
     * scaling with rotor speed). No-op until SPEED_PI_Enable() called
     * by CL state entry. */
    SPEED_PI_OnZcEvent(pData);
#endif
}
#endif /* FEATURE_HWZC_SECTOR_PI */

/**
 * @brief ZC timeout — no crossing detected within 2x step period.
 * Called from SCCP1 ISR when phase == HWZC_WATCHING.
 * Either forces a step or falls back to software ZC on miss-limit.
 */
void HWZC_OnTimeout(volatile GARUDA_DATA_T *pData)
{
    /* Capture diagnostics: what did the ADC channel actually see? */
    uint8_t core = pData->hwzc.activeCore;
    if (core == 1)
    {
        pData->hwzc.dbgTimeoutAdcVal = AD1CH5DATA;
        pData->hwzc.dbgTimeoutThresh = AD1CH5CMPLO;
        pData->hwzc.dbgTimeoutCmpmod = AD1CH5CONbits.CMPMOD;
        pData->hwzc.dbgTimeoutCmpstat = AD1CMPSTATbits.CH5CMP;
    }
    else
    {
        pData->hwzc.dbgTimeoutAdcVal = AD2CH1DATA;
        pData->hwzc.dbgTimeoutThresh = AD2CH1CMPLO;
        pData->hwzc.dbgTimeoutCmpmod = AD2CH1CONbits.CMPMOD;
        pData->hwzc.dbgTimeoutCmpstat = AD2CMPSTATbits.CH1CMP;
    }
    pData->hwzc.dbgTimeoutCore = core;
    pData->hwzc.dbgTimeoutStep = pData->currentStep;
    pData->hwzc.dbgTimeoutBemfThresh = pData->bemf.zcThreshold;

