bhanuprakashjh/ProjectGaruda/dspic33AKESC/motor/hwzc.c
    pData->hwzc.missCount++;
    pData->hwzc.totalMissCount++;
    pData->hwzc.stepsSinceLastHwZc++;

    if (pData->hwzc.goodZcCount > 0)
        pData->hwzc.goodZcCount--;

    if (pData->hwzc.missCount >= HWZC_MISS_LIMIT)
    {
        /* Too many misses — fall back to software ZC.
         * Clear goodZcCount to prevent stale synced re-seed.
         * Latch disable to prevent re-enable cycling (preserves diagnostics). */
        pData->hwzc.goodZcCount = 0;
        pData->hwzc.dbgLatchDisable = true;
        HWZC_Disable(pData);
        return;
    }

    /* Forced step: advance commutation and try next step */
    COMMUTATION_AdvanceStep(pData);
    pData->hwzc.totalCommCount++;
    pData->hwzc.commSeq++;

    HWZC_OnCommutation(pData);
}

#if HWZC_USE_SW_COMPARE
/**
 * @brief Software ZC detection on a mid-ON ADC sample.
 * Called from the 24 kHz ADC ISR after bemfRaw is populated. Replaces the
 * 1 MHz hardware digital comparator path — mid-ON sampling avoids the
 * 48 kHz phantom-crossing issue where PWM ripple through the board's
 * 5.5 kHz RC filter constantly crosses the threshold.
 *
 * Runs the exact same accept logic as HWZC_OnZcDetected (plausibility gate,
 * IIR update, commDelay scheduling) minus the HW comparator re-arm. State
 * machine (BLANKING → WATCHING → COMM_PENDING) is identical.
 *
 * No-op unless enabled && phase == HWZC_WATCHING && sample is valid.
 */
void HWZC_OnSoftwareSample(volatile GARUDA_DATA_T *pData)
{
    if (!pData->hwzc.enabled) return;
    if (pData->hwzc.phase != HWZC_WATCHING) return;
    if (!pData->bemf.bemfSampleValid) return;   /* AD2 pin-mux settling */

    uint8_t step = pData->currentStep;
    int8_t  pol = commutationTable[step].zcPolarity;
    bool    risingZc = (pol > 0);

    /* Apply deadband/hysteresis matching the HW comparator path */
    uint16_t thresh = pData->bemf.zcThreshold;
    if (risingZc)
        thresh = (thresh + HWZC_CMP_DEADBAND < 4095) ? thresh + HWZC_CMP_DEADBAND : 4095;
    else
        thresh = (thresh > HWZC_CMP_DEADBAND) ? thresh - HWZC_CMP_DEADBAND : 0;

    uint16_t bemfRaw = pData->bemf.bemfRaw;
    bool crossed = risingZc ? (bemfRaw > thresh) : (bemfRaw < thresh);
    if (!crossed) return;

    uint32_t zcStamp = HAL_SCCP2_ReadTimestamp();

    /* First ZC after HWZC_Enable: bypass plausibility gate + skip IIR.
     * See HWZC_OnZcDetected for rationale. */
    if (pData->hwzc.firstZcAfterEnable) {
        pData->hwzc.firstZcAfterEnable = false;
        HAL_SCCP1_Stop();
        pData->hwzc.lastZcStamp = zcStamp;
        pData->hwzc.stepsSinceLastHwZc = 0;
        if (pData->hwzc.goodZcCount < 0xFFFE)
            pData->hwzc.goodZcCount++;
        pData->hwzc.missCount = 0;
        pData->hwzc.totalZcCount++;

        uint32_t commDelay;
#if FEATURE_TIMING_ADVANCE
        {
            uint32_t eRPM = HWZC_TICKS_TO_ERPM(pData->hwzc.stepPeriodHR);
            uint16_t advDeg;
            if (eRPM <= RT_RAMP_TARGET_ERPM)
                advDeg = TIMING_ADVANCE_MIN_DEG;
            else if (eRPM >= RT_MAX_CLOSED_LOOP_ERPM)
                advDeg = RT_TIMING_ADV_MAX_DEG;
            else {
                uint32_t range = RT_MAX_CLOSED_LOOP_ERPM - RT_RAMP_TARGET_ERPM;
                uint32_t pos   = eRPM - RT_RAMP_TARGET_ERPM;
                advDeg = TIMING_ADVANCE_MIN_DEG +
                    (uint16_t)((uint32_t)(RT_TIMING_ADV_MAX_DEG - TIMING_ADVANCE_MIN_DEG)
                               * pos / range);
            }
            commDelay = pData->hwzc.stepPeriodHR * (30 - advDeg) / 60;
            pData->hwzc.dbgAdvanceDeg = advDeg;
        }
#else
        commDelay = pData->hwzc.stepPeriodHR / 2;
#endif
        if (commDelay < 10) commDelay = 10;
        pData->hwzc.phase = HWZC_COMM_PENDING;
        HAL_SCCP1_StartOneShot(commDelay);
        return;
    }

    /* Plausibility gate: reject intervals shorter than 70% of stepPeriodHR,
     * with RT_HWZC_MIN_STEP_TICKS as hard floor (physical max eRPM). */
    uint32_t interval = zcStamp - pData->hwzc.lastZcStamp;
    uint32_t minInterval = pData->hwzc.stepPeriodHR
                           * HWZC_MIN_INTERVAL_PCT / 100;
    if (minInterval < RT_HWZC_MIN_STEP_TICKS)
        minInterval = RT_HWZC_MIN_STEP_TICKS;

    if (interval < minInterval) {
        pData->hwzc.noiseRejectCount++;
        pData->hwzc.rejectsThisStep++;
        return;  /* stay in WATCHING; timeout still armed */
    }

    /* Cancel timeout */
    HAL_SCCP1_Stop();

    /* Update IIR: see HWZC_OnZcDetected for the freeze-first-N rationale. */
    if (pData->hwzc.stepsSinceLastHwZc == 1
        && pData->hwzc.goodZcCount >= HWZC_IIR_FREEZE_ZC_COUNT) {
        pData->hwzc.writeSeq++;
        uint32_t newPeriod = (3 * pData->hwzc.stepPeriodHR + interval) / 4;
        if (newPeriod < RT_HWZC_MIN_STEP_TICKS)
            newPeriod = RT_HWZC_MIN_STEP_TICKS;
        pData->hwzc.stepPeriodHR = newPeriod;
        pData->hwzc.writeSeq++;
    }
    pData->hwzc.stepsSinceLastHwZc = 0;
    pData->hwzc.lastZcStamp = zcStamp;

    if (pData->hwzc.goodZcCount < 0xFFFE)
        pData->hwzc.goodZcCount++;
    pData->hwzc.missCount = 0;
    pData->hwzc.totalZcCount++;

    /* Schedule commutation (same advance/delay math as HW path) */
    uint32_t commDelay;
#if FEATURE_TIMING_ADVANCE
    {
        uint32_t eRPM = HWZC_TICKS_TO_ERPM(pData->hwzc.stepPeriodHR);
        uint16_t advDeg;
        if (eRPM <= RT_RAMP_TARGET_ERPM)
            advDeg = TIMING_ADVANCE_MIN_DEG;
        else if (eRPM >= RT_MAX_CLOSED_LOOP_ERPM)
            advDeg = RT_TIMING_ADV_MAX_DEG;
        else {
            uint32_t range = RT_MAX_CLOSED_LOOP_ERPM - RT_RAMP_TARGET_ERPM;
            uint32_t pos   = eRPM - RT_RAMP_TARGET_ERPM;
            advDeg = TIMING_ADVANCE_MIN_DEG +
                (uint16_t)((uint32_t)(RT_TIMING_ADV_MAX_DEG - TIMING_ADVANCE_MIN_DEG)
                           * pos / range);
        }
        commDelay = pData->hwzc.stepPeriodHR * (30 - advDeg) / 60;
        pData->hwzc.dbgAdvanceDeg = advDeg;
    }
#else
    commDelay = pData->hwzc.stepPeriodHR / 2;
#endif
    if (commDelay < 10) commDelay = 10;

    pData->hwzc.phase = HWZC_COMM_PENDING;
    HAL_SCCP1_StartOneShot(commDelay);
}
#endif /* HWZC_USE_SW_COMPARE */

#endif /* FEATURE_ADC_CMP_ZC */
